<?php
/* ============================================================================== */
/* =   01. 지불 요청 정보 설정                                                  = */
/* = -------------------------------------------------------------------------- = */
$req_tx         = $_POST[ "req_tx"         ]; // 요청 종류
$tran_cd        = $_POST[ "tran_cd"        ]; // 처리 종류
/* = -------------------------------------------------------------------------- = */
$cust_ip        = getenv( "REMOTE_ADDR"    ); // 요청 IP
$ordr_idxx      = $_POST[ "ordr_idxx"      ]; // 쇼핑몰 주문번호
$good_name      = $_POST[ "good_name"      ]; // 상품명
$good_mny       = $_POST[ "good_mny"       ]; // 결제 총금액
/* = -------------------------------------------------------------------------- = */
$res_cd         = "";                         // 응답코드
$res_msg        = "";                         // 응답메시지
$res_en_msg     = "";                         // 응답 영문 메세지
$tno            = $_POST[ "tno"            ]; // KCP 거래 고유 번호
$vcnt_yn        = $_POST[ "vcnt_yn"        ]; // 가상계좌 에스크로 사용 유무
/* = -------------------------------------------------------------------------- = */
$buyr_name      = $_POST[ "buyr_name"      ]; // 주문자명
$buyr_tel1      = $_POST[ "buyr_tel1"      ]; // 주문자 전화번호
$buyr_tel2      = $_POST[ "buyr_tel2"      ]; // 주문자 핸드폰 번호
$buyr_mail      = $_POST[ "buyr_mail"      ]; // 주문자 E-mail 주소
/* = -------------------------------------------------------------------------- = */
$mod_type       = $_POST[ "mod_type"       ]; // 변경TYPE VALUE 승인취소시 필요
$mod_desc       = $_POST[ "mod_desc"       ]; // 변경사유
$panc_mod_mny   = "";                         // 부분취소 금액
$panc_rem_mny   = "";                         // 부분취소 가능 금액
$mod_tax_mny    = $_POST[ "mod_tax_mny"    ]; // 공급가 부분 취소 요청 금액
$mod_vat_mny    = $_POST[ "mod_vat_mny"    ]; // 부과세 부분 취소 요청 금액
$mod_free_mny   = $_POST[ "mod_free_mny"   ]; // 비과세 부분 취소 요청 금액
/* = -------------------------------------------------------------------------- = */
$use_pay_method = $_POST[ "use_pay_method" ]; // 결제 방법
$bSucc          = "";                         // 업체 DB 처리 성공 여부
/* = -------------------------------------------------------------------------- = */
$app_time       = "";                         // 승인시간 (모든 결제 수단 공통)
$total_amount   = 0;                          // 복합결제시 총 거래금액
$amount         = "";                         // KCP 실제 거래 금액
$coupon_mny     = "";                         // 쿠폰금액
/* = -------------------------------------------------------------------------- = */
$card_cd        = "";                         // 신용카드 코드
$card_name      = "";                         // 신용카드 명
$app_no         = "";                         // 신용카드 승인번호
$noinf          = "";                         // 신용카드 무이자 여부
$quota          = "";                         // 신용카드 할부개월
$partcanc_yn    = "";                         // 부분취소 가능유무
$card_bin_type_01 = "";                       // 카드구분1
$card_bin_type_02 = "";                       // 카드구분2
$card_mny       = "";                         // 카드결제금액
/* = -------------------------------------------------------------------------- = */
$bank_name      = "";                         // 은행명
$bank_code      = "";                         // 은행코드
$bk_mny         = "";                         // 계좌이체결제금액
/* = -------------------------------------------------------------------------- = */
$bankname       = "";                         // 입금할 은행명
$depositor      = "";                         // 입금할 계좌 예금주 성명
$account        = "";                         // 입금할 계좌 번호
$va_date        = "";                         // 가상계좌 입금마감시간
/* = -------------------------------------------------------------------------- = */
$pnt_issue      = "";                         // 결제 포인트사 코드
$pnt_amount     = "";                         // 적립금액 or 사용금액
$pnt_app_time   = "";                         // 승인시간
$pnt_app_no     = "";                         // 승인번호
$add_pnt        = "";                         // 발생 포인트
$use_pnt        = "";                         // 사용가능 포인트
$rsv_pnt        = "";                         // 총 누적 포인트
/* = -------------------------------------------------------------------------- = */
$commid         = "";                         // 통신사 코드
$mobile_no      = "";                         // 휴대폰 코드
/* = -------------------------------------------------------------------------- = */
$shop_user_id   = $_POST[ "shop_user_id"   ]; // 가맹점 고객 아이디
$tk_van_code    = "";                         // 발급사 코드
$tk_app_no      = "";                         // 상품권 승인 번호
/* = -------------------------------------------------------------------------- = */
$cash_yn        = $_POST[ "cash_yn"        ]; // 현금 영수증 등록 여부
$cash_authno    = "";                         // 현금 영수증 승인 번호
$cash_tr_code   = $_POST[ "cash_tr_code"   ]; // 현금 영수증 발행 구분
$cash_id_info   = $_POST[ "cash_id_info"   ]; // 현금 영수증 등록 번호
/* ============================================================================== */
/* =   01-1. 에스크로 지불 요청 정보 설정                                       = */
/* = -------------------------------------------------------------------------- = */  
$escw_used      = $_POST[  "escw_used"     ]; // 에스크로 사용 여부
$pay_mod        = $_POST[  "pay_mod"       ]; // 에스크로 결제처리 모드
$deli_term      = $_POST[  "deli_term"     ]; // 배송 소요일
$bask_cntx      = $_POST[  "bask_cntx"     ]; // 장바구니 상품 개수
$good_info      = $_POST[  "good_info"     ]; // 장바구니 상품 상세 정보
$rcvr_name      = $_POST[  "rcvr_name"     ]; // 수취인 이름
$rcvr_tel1      = $_POST[  "rcvr_tel1"     ]; // 수취인 전화번호
$rcvr_tel2      = $_POST[  "rcvr_tel2"     ]; // 수취인 휴대폰번호
$rcvr_mail      = $_POST[  "rcvr_mail"     ]; // 수취인 E-Mail
$rcvr_zipx      = $_POST[  "rcvr_zipx"     ]; // 수취인 우편번호
$rcvr_add1      = $_POST[  "rcvr_add1"     ]; // 수취인 주소
$rcvr_add2      = $_POST[  "rcvr_add2"     ]; // 수취인 상세주소
$escw_yn		= "";                         // 에스크로 여부
/* = -------------------------------------------------------------------------- = */
/* =   01. 지불 요청 정보 설정 END                                              = */
/* ============================================================================== */

/* ============================================================================== */
/* =   02. 인스턴스 생성 및 초기화(변경 불가)                                   = */
/* = -------------------------------------------------------------------------- = */
/* =       결제에 필요한 인스턴스를 생성하고 초기화 합니다.                     = */
/* = -------------------------------------------------------------------------- = */
$c_PayPlus = new C_PP_CLI;

$c_PayPlus->mf_clear();
/* ------------------------------------------------------------------------------ */
/* =   02. 인스턴스 생성 및 초기화 END                                          = */
/* ============================================================================== */


/* ============================================================================== */
/* =   03. 처리 요청 정보 설정                                                  = */
/* = -------------------------------------------------------------------------- = */
/* = -------------------------------------------------------------------------- = */
/* =   03-1. 승인 요청 정보 설정                                                = */
/* = -------------------------------------------------------------------------- = */

if ( $req_tx == "pay" )
{
		/* 1004원은 실제로 업체에서 결제하셔야 될 원 금액을 넣어주셔야 합니다. 결제금액 유효성 검증 */
		$c_PayPlus->mf_set_ordr_data( "ordr_mony",  $good_mny );

		$c_PayPlus->mf_set_encx_data( $_POST[ "enc_data" ], $_POST[ "enc_info" ] );
}

/* = -------------------------------------------------------------------------- = */
/* =   03-2. 취소/매입 요청                                                     = */
/* = -------------------------------------------------------------------------- = */
else if ( $req_tx == "mod" )
{
	$tran_cd = "00200000";

	$c_PayPlus->mf_set_modx_data( "tno",      $tno      ); // KCP 원거래 거래번호
	$c_PayPlus->mf_set_modx_data( "mod_type", $mod_type ); // 원거래 변경 요청 종류
	$c_PayPlus->mf_set_modx_data( "mod_ip",   $cust_ip  ); // 변경 요청자 IP
	$c_PayPlus->mf_set_modx_data( "mod_desc", iconv_euckr($mod_desc) ); // 변경 사유

	if ( $mod_type == "STPC" )
	{
		$c_PayPlus->mf_set_modx_data( "mod_mny", strval($mod_mny) ); // 취소요청금액
		$c_PayPlus->mf_set_modx_data( "rem_mny", strval($rem_mny) ); // 취소가능잔액

		if($od['taxflag'] && $od['gs_notax'])
		{
			$mod_tax_mny = round((int)$mod_mny / 1.1);
			$mod_vat_mny = (int)$mod_mny - $mod_tax_mny;
			$mod_free_mny = 0;

			$c_PayPlus->mf_set_modx_data( "tax_flag",     "TG03"        ); // 복합과세 구분
			$c_PayPlus->mf_set_modx_data( "mod_tax_mny",  $mod_tax_mny  ); // 공급가 부분 취소 요청 금액
			$c_PayPlus->mf_set_modx_data( "mod_vat_mny",  $mod_vat_mny  ); // 부과세 부분 취소 요청 금액
			$c_PayPlus->mf_set_modx_data( "mod_free_mny", $mod_free_mny ); // 비과세 부분 취소 요청 금액
		}
	}
}

/* = -------------------------------------------------------------------------- = */
/* =   03-3. 에스크로 상태변경 요청                                             = */
/* = -------------------------------------------------------------------------- = */
else if ($req_tx = "mod_escrow")
{
	$tran_cd = "00200000";

	$c_PayPlus->mf_set_modx_data( "tno",      $tno      ); // KCP 원거래 거래번호
	$c_PayPlus->mf_set_modx_data( "mod_type", $mod_type ); // 원거래 변경 요청 종류
	$c_PayPlus->mf_set_modx_data( "mod_ip",   $cust_ip  ); // 변경 요청자 IP
	$c_PayPlus->mf_set_modx_data( "mod_desc", $mod_desc ); // 변경 사유 

	// 상태변경 타입이 [배송요청]인 경우
	if ($mod_type == "STE1")                                                    
	{
		$c_PayPlus->mf_set_modx_data( "deli_numb",   $_POST[ "deli_numb" ] ); // 운송장 번호
		$c_PayPlus->mf_set_modx_data( "deli_corp",   $_POST[ "deli_corp" ] ); // 택배 업체명
	}
	// 상태변경 타입이 [즉시취소] 또는 [취소]인 계좌이체, 가상계좌의 경우
	else if ($mod_type == "STE2" || $mod_type == "STE4") 
	{
		if ($vcnt_yn == "Y")
		{
			$c_PayPlus->mf_set_modx_data( "refund_account",   $_POST[ "refund_account" ] ); // 환불수취계좌번호
			$c_PayPlus->mf_set_modx_data( "refund_nm",        $_POST[ "refund_nm"      ] ); // 환불수취계좌주명
			$c_PayPlus->mf_set_modx_data( "bank_code",        $_POST[ "bank_code"      ] ); // 환불수취은행코드
		}
	}
}
/* = -------------------------------------------------------------------------- = */
/* =   03-3. 에스크로 상태변경 요청 END                                         = */
/* = -------------------------------------------------------------------------- = */


/* ------------------------------------------------------------------------------ */
/* =   03.  처리 요청 정보 설정 END                                             = */
/* ============================================================================== */

/* ============================================================================== */
/* =   04. 실행                                                                 = */
/* = -------------------------------------------------------------------------- = */
$ca_logs  = "";
if ( $tran_cd != "" )
{
	$c_PayPlus->mf_do_tx( $trace_no, $g_conf_home_dir, $g_conf_site_cd, $g_conf_site_key, $tran_cd, "",
						  $g_conf_gw_url, $g_conf_gw_port, "payplus_cli_slib", $ordr_idxx,
						  "", "3" , 0, 0, $g_conf_key_dir, $g_conf_log_dir); // 응답 전문 처리

	$res_cd   = $c_PayPlus->m_res_cd;  // 결과 코드
	$res_msg  = $c_PayPlus->m_res_msg; // 결과 메시지
  //$res_en_msg = $c_PayPlus->mf_get_res_data( "res_en_msg" ); // 결과 영문 메세지

	$ca_logs .= "결과코드 : $res_cd, 결과메시지 : ".iconv_utf8($res_msg);
}
else
{
	$res_cd   =  $c_PayPlus->m_res_cd  = "9562";
	$res_msg  =  $c_PayPlus->m_res_msg = "연동 오류|Payplus Plugin이 설치되지 않았거나 tran_cd값이 설정되지 않았습니다.";

	$ca_logs .= "결과코드 : $res_cd, 결과메시지 : ".iconv_utf8($res_msg);
	//die($ca_logs);
}

set_session('ss_pay_method', '');
/* = -------------------------------------------------------------------------- = */
/* =   04. 실행 END                                                             = */
/* ============================================================================== */
?>